#### Terraform Initialization `success`
#### Terraform Validation `success`
#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```bash


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.sns_topic.data.aws_iam_policy_document.read will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "read" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:GetTopicAttributes",
              + "SNS:ListSubscriptionsByTopic",
              + "SNS:Receive",
              + "SNS:Subscribe",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.sns_topic.data.aws_iam_policy_document.write will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "write" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.sns_topic.aws_cloudwatch_metric_alarm.sns-failure-alarm[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "sns-failure-alarm" {
      + actions_enabled                       = true
      + alarm_description                     = "sns-topic-consumer sns failures"
      + alarm_name                            = "sns-topic-consumer-snsFailureAlarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + tags_all                              = {
          + "example"        = "aws/sns-topic/consumer"
          + "ops/managed-by" = "terraform"
        }
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"

      + metric_query {
          + id          = "failedDelivery"
          + return_data = false

          + metric {
              + dimensions  = {
                  + "TopicName" = "sns-topic-consumer"
                }
              + metric_name = "NumberOfNotificationsFailed"
              + namespace   = "AWS/SNS"
              + period      = 60
              + stat        = "Sum"
            }
        }
      + metric_query {
          + id          = "failedDlq"
          + return_data = false

          + metric {
              + dimensions  = {
                  + "TopicName" = "sns-topic-consumer"
                }
              + metric_name = "NumberOfNotificationsFailedToRedriveToDlq"
              + namespace   = "AWS/SNS"
              + period      = 60
              + stat        = "Sum"
            }
        }
      + metric_query {
          + id          = "invalidAttributes"
          + return_data = false

          + metric {
              + dimensions  = {
                  + "TopicName" = "sns-topic-consumer"
                }
              + metric_name = "NumberOfNotificationsFilteredOut-InvalidAttributes"
              + namespace   = "AWS/SNS"
              + period      = 60
              + stat        = "Sum"
            }
        }
      + metric_query {
          + expression  = "(invalidAttributes + failedDelivery + failedDlq)"
          + id          = "snsFailures"
          + label       = "SNS failures (invalid attributes, failed DLQ, failed delivery)"
          + return_data = true
        }
    }

  # module.sns_topic.aws_iam_policy.write will be created
  + resource "aws_iam_policy" "write" {
      + arn         = (known after apply)
      + description = "Allow write to sns-topic-consumer"
      + id          = (known after apply)
      + name        = "sns-topic-consumer-sns-write"
      + path        = "/ops/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "Name"       = "sns-topic-consumer"
          + "ops/module" = "aws/sns-topic"
        }
      + tags_all    = {
          + "Name"           = "sns-topic-consumer"
          + "example"        = "aws/sns-topic/consumer"
          + "ops/managed-by" = "terraform"
          + "ops/module"     = "aws/sns-topic"
        }
    }

  # module.sns_topic.aws_sns_topic.topic will be created
  + resource "aws_sns_topic" "topic" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "sns-topic-consumer"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + tags                        = {
          + "Name"               = "sns-topic-consumer"
          + "ops/module"         = "aws/sns-topic"
          + "ops/module-primary" = "aws/sns-topic"
        }
      + tags_all                    = {
          + "Name"               = "sns-topic-consumer"
          + "example"            = "aws/sns-topic/consumer"
          + "ops/managed-by"     = "terraform"
          + "ops/module"         = "aws/sns-topic"
          + "ops/module-primary" = "aws/sns-topic"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + arn           = (known after apply)
  + failure_alarm = {
      + arn = (known after apply)
      + id  = (known after apply)
    }
  + name          = "sns-topic-consumer"
  + read_policy   = {
      + document = (known after apply)
    }
  + url           = (known after apply)
  + write_policy  = {
      + arn      = (known after apply)
      + document = (known after apply)
    }

```

</details>

*Pusher: @mjheitland, Action: `pull_request_target`*